// ******** Моделирование катания доски на валиках **********
// ******** (С) Степан Воротницкий *************************
// *******************************************************

// ******** Библиотеки ***********
#include <eCOM.h> // общие определения констант для учебного стенда

const double g = 10; //ускорение свободного падения
double l = 2; // Длина доски 
double L = 1; // Расстояние между валиками
double mu = 0.3; // коэффициент трения 
double t = 0; // текущее время
double v = 0; // текущая скорость
double dv = 0; // изменение скорости
double vn = 0; // новая скорость
double x = 0.6; // текущая координата х
double dx = 0; // изменение координаты х
double dt = 0.001; // изменение времени
double a = 0; // текущее ускорение
int i = 0; 

// ********************** SETUP ****************************
void setup() {   
   Wire.begin(); 
   Serial.begin(9600); 
   Serial.println ();
   while (t<30){
      if (i % 100 == 0 ){ 
          Serial.print (t,4);
          Serial.print ("    ");
          Serial.print (x,4);
          Serial.print ("    ");
          Serial.print (vn,4);
          Serial.println();
    }
     a = mu*g*(2*(l/2-x)/L-1); // расчет ускорения
     dv = a*dt;
     vn = v + dv; 
     dx = (v+vn)/2*dt;
     x = x + dx;
     t = t+dt;
     v=vn; 
     i++;
  }
} // ********************** END SETUP *************************

void loop() {
}
